siredmar/master/Recherche/EA313x/software/csps/lpc313x/source/lpc315x_psu_driver.c
/***********************************************************************
 * $Id:: lpc315x_psu_driver.c 1388 2008-12-01 19:20:06Z pdurgesh      $
 *
 * Project: LPC315x PSU driver
 *
 * Description:
 *     This file contains driver support for the LPC315x PSU
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "lpc313x_i2c_driver.h"
#include "lpc315x_psu_driver.h"

/***********************************************************************
 * PSU driver package data
***********************************************************************/

/* for i2c usage */
#define S_DCDC_IIC_ADDRESS                       0x0C
#define S_DCDC_BUFFER_LEN                        6

/* defines for address and data masking */
#define S_DCDC_ADDRESS_FIRST_BYTE_MASK           0x00FF
#define S_DCDC_ADDRESS_LAST_BYTE_MASK            0xFF00
#define S_DCDC_DATA_FIRST_BYTE_MASK              0x000000FF
#define S_DCDC_DATA_SECOND_BYTE_MASK             0x0000FF00
#define S_DCDC_DATA_THIRD_BYTE_MASK              0x00FF0000
#define S_DCDC_DATA_LAST_BYTE_MASK               0xFF000000
#define S_DCDC_SHIFT_0BIT                        0
#define S_DCDC_SHIFT_8BIT                        8
#define S_DCDC_SHIFT_16BIT                       16
#define S_DCDC_SHIFT_24BIT                       24
#define S_DCDC_AD_MINOR_VERSION_3                3

/* PSU device configuration structure type */
typedef struct
{
  BOOL_32 init;           /* Device initialized flag */
  AD_REGS_T *regptr;      /* Pointer to AD registers */
} PSU_CFG_T;

/* PSU driver data */
static PSU_CFG_T psudat;

/* I2C device handle */
static INT_32 i2cdev1;

/***********************************************************************
 * PSU driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: psu_dcdc_i2c_read
 *
 * Purpose: Read the PSU register through i2c interface
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as PSU was not
 *     previously opened. Otherwise, read PSU register.
 *
 * Parameters:
 *     devid: Pointer to I2C config structure
 *     reg_addr: PSU register address
 *     reg_data: Pointer to PSU register data
 *
 * Outputs: None
 *
 * Returns: The status of read operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS psu_dcdc_i2c_read(INT_32 devid,
                         UNS_32 reg_addr,
                         UNS_32 *reg_data)
{
  STATUS status = _ERROR;
  UNS_8 buf[S_DCDC_BUFFER_LEN];
  I2C_MTXRX_SETUP_T i2c_mtxrx_setup;

  if (psudat.init == TRUE)
  {
    status = _NO_ERROR;

    /*spilt the address into lower byte and higher byte */
    buf[1] = (UNS_8)(((reg_addr / 4) &
                      S_DCDC_ADDRESS_FIRST_BYTE_MASK) >>
                     S_DCDC_SHIFT_0BIT);
    buf[0] = (UNS_8)(((reg_addr / 4) &
                      S_DCDC_ADDRESS_LAST_BYTE_MASK) >>
                     S_DCDC_SHIFT_8BIT);
    buf[5] = 0;
    buf[4] = 0;
    buf[3] = 0;
    buf[2] = 0;

    i2c_mtxrx_setup.addr_mode = ADDR7BIT;
    i2c_mtxrx_setup.sl_addr = S_DCDC_IIC_ADDRESS;
    i2c_mtxrx_setup.tx_data = &buf[0];
    i2c_mtxrx_setup.tx_length = 2;
    i2c_mtxrx_setup.rx_data = &buf[2];
    i2c_mtxrx_setup.rx_length = 4;
    i2c_mtxrx_setup.retransmissions_max = 1;
    i2c_ioctl(devid, I2C_MASTER_TXRX, (INT_32)&i2c_mtxrx_setup);
    while ((i2c_mtxrx_setup.status & I2C_SETUP_STATUS_DONE) == 0);

    *reg_data = (UNS_32)buf[2] << S_DCDC_SHIFT_24BIT ;
    *reg_data = *reg_data | ((UNS_32)buf[3] << S_DCDC_SHIFT_16BIT);
    *reg_data = *reg_data | ((UNS_32)buf[4] << S_DCDC_SHIFT_8BIT);
    *reg_data = *reg_data | (UNS_32)buf[5];
  }

  return status;
}

/***********************************************************************
 *
 * Function: psu_dcdc_i2c_write
 *
 * Purpose: Write the PSU register through i2c interface
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as PSU was not
 *     previously opened. Otherwise, write PSU register.
 *
 * Parameters:
 *     devid: Pointer to I2C config structure
 *     reg_addr: PSU register address
 *     reg_data: Pointer to PSU register data
 *
 * Outputs: None
 *
 * Returns: The status of write operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS psu_dcdc_i2c_write(INT_32 devid,
                          UNS_32 reg_addr,
                          UNS_32 *reg_data)
{
  STATUS status = _ERROR;
  UNS_8 buf[S_DCDC_BUFFER_LEN];
  I2C_MTX_SETUP_T i2c_mtx_setup;

  if (psudat.init == TRUE)
  {
    status = _NO_ERROR;

    buf[1] = (UNS_8)(((reg_addr / 4) &
                      S_DCDC_ADDRESS_FIRST_BYTE_MASK) >>
                     S_DCDC_SHIFT_0BIT);
    buf[0] = (UNS_8)(((reg_addr / 4) &
                      S_DCDC_ADDRESS_LAST_BYTE_MASK) >>
                     S_DCDC_SHIFT_8BIT);
    buf[5] = (UNS_8)((*reg_data & S_DCDC_DATA_FIRST_BYTE_MASK) >>
                     S_DCDC_SHIFT_0BIT);
    buf[4] = (UNS_8)((*reg_data & S_DCDC_DATA_SECOND_BYTE_MASK) >>
                     S_DCDC_SHIFT_8BIT);
    buf[3] = (UNS_8)((*reg_data & S_DCDC_DATA_THIRD_BYTE_MASK) >>
                     S_DCDC_SHIFT_16BIT);
    buf[2] = (UNS_8)((*reg_data & S_DCDC_DATA_LAST_BYTE_MASK) >>
                     S_DCDC_SHIFT_24BIT);

