siredmar/master/Recherche/EA313x/software/csps/lpc313x/source/lpc315x_psu_driver.c
    i2c_mtx_setup.addr_mode = ADDR7BIT;
    i2c_mtx_setup.sl_addr = S_DCDC_IIC_ADDRESS;
    i2c_mtx_setup.tx_data = &buf[0];
    i2c_mtx_setup.tx_length = 6;
    i2c_mtx_setup.retransmissions_max = 1;
    i2c_ioctl(devid, I2C_MASTER_TX, (INT_32)&i2c_mtx_setup);
    while ((i2c_mtx_setup.status & I2C_SETUP_STATUS_DONE) == 0);
  }

  return status;
}

/***********************************************************************
 * PSU driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: psu_open
 *
 * Purpose: Open the PSU
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipbase: Pointer to a PSU block
 *     arg   : Not used
 *
 * Outputs: None
 *
 * Returns: The pointer to a PSU config structure or
 *          NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 psu_open(void *ipbase, INT_32 arg)
{
  UNS_32 reg_value;
  INT_32 status = 0;
  I2C_SETUP_T i2c_setup;

  if ((AD_REGS_T *) ipbase == AD)
  {
    /* Has PSU driver been previously initialized? */
    if (psudat.init == FALSE)
    {
      /* Device not initialized and it usable, so set it to
         used */
      psudat.init = TRUE;

      /* Save address of register block */
      psudat.regptr = AD;

      /* open I2C1 */
      i2cdev1 = i2c_open((void *)I2C1, 0);

      /* formally assign a 7-bit address for I2C1,
         clock is 100 kHz, 50% duty cycle. */
      i2c_setup.addr_mode = ADDR7BIT;
      i2c_setup.rate_option = I2C_RATE_RELATIVE;
      i2c_setup.rate       = 50000;
      i2c_setup.low_phase  = 50;
      i2c_setup.high_phase = 50;
      i2c_ioctl(i2cdev1, I2C_SETUP, (INT_32)&i2c_setup);

      /* read the ad_reg_cgu_rw register through i2c
         interface */
      if (psu_dcdc_i2c_read(i2cdev1,
                            (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                            &reg_value) == _ERROR)
      {
        return status;
      }

      /* Power up DCDC clock */
      reg_value &= ~((UNS_32)CGU_RW_PD_DCDC_CLK);

      /* write the ad_reg_cgu_rw register through i2c
         interface */
      if (psu_dcdc_i2c_write(i2cdev1,
                             (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                             &reg_value) == _ERROR)
      {
        return status;
      }

      /* Return pointer to PSU config structure */
      status = (INT_32) & psudat;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: psu_close
 *
 * Purpose: Close the PSU
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, close the PSU,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to PSU config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS psu_close(INT_32 devid)
{
  UNS_32 reg_value;
  STATUS status = _ERROR;

  if ((PSU_CFG_T *) devid == &psudat)
  {
    if (psudat.init == TRUE)
    {
      /* read the ad_reg_cgu_rw register through i2c
         interface */
      if (psu_dcdc_i2c_read(i2cdev1,
                            (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                            &reg_value) == _ERROR)
      {
        return status;
      }

      /* Power down DCDC clock */
      reg_value |= ((UNS_32)CGU_RW_PD_DCDC_CLK);

      /* write the ad_reg_cgu_rw register through i2c
         interface */
      if (psu_dcdc_i2c_write(i2cdev1,
                             (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                             &reg_value) == _ERROR)
      {
        return status;
      }

      /* close I2C1 */
      i2c_close(i2cdev1);

      /* Set device as uninitialized */
      psudat.init = FALSE;

      /* Successful operation */
      status = _NO_ERROR;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: psu_ioctl
 *
 * Purpose: PSU configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate PSU parameter.
 *
 * Parameters:
 *     devid: Pointer to PSU config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS psu_ioctl(INT_32 devid,
                 INT_32 cmd,
                 INT_32 arg)
{
  UNS_32 reg_value;
  UNS_32 volt_value;
  UNS_32 minor_rev;
  INT_32 status = _ERROR;

  if ((PSU_CFG_T *) devid == &psudat)
  {
    if (psudat.init == TRUE)
    {
      status = _NO_ERROR;

      switch (cmd)
      {
        case PSU_WRITE_VOLTAGE:
          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }
          /*check whether DCDC1 or DCDC2 is selected */
          switch (((PSU_DCDC_VOLTAGE_T *) arg)->psu_dcdc_select)
          {
            case PSU_DCDC_DCDC1:
              /* get the DCDC1 control bits to the lower byte */
              volt_value = (reg_value &
                            OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST(7)) >>
                           OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST_POS;

              /* if previous range greater than the specified range */
              if ((PSU_DCDC_RANGE_T)volt_value >
                  *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
              {
                /* do a step wise decrement of the present range and
                   set it, until it becomes equal to the specified
                   range */
                while ((PSU_DCDC_RANGE_T)volt_value >
                       *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
                {
                  /* reset the control bits for DCDC1 */
                  reg_value &=
                    (~(UNS_32)OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST(7));

                  /* reduce the present range by one */
                  (PSU_DCDC_RANGE_T)volt_value--;

