siredmar/master/Recherche/EA313x/software/csps/lpc313x/source/lpc315x_psu_driver.c
                  /*set the intermidiate range */
                  reg_value |= (volt_value <<
                                OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST_POS);

                  /* write the ad_reg_otgdclic_rw register through i2c
                     interface */
                  if (psu_dcdc_i2c_write(i2cdev1,
                                         (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                         &reg_value) == _ERROR)
                  {
                    return _ERROR;
                  }
                }
              }
              else
              {
                /* do a step wise increment of the present range and
                   set it, until it becomes equal to the specified
                   range */
                while ((PSU_DCDC_RANGE_T)volt_value <
                       *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
                {
                  /* reset the control bits for DCDC1 */
                  reg_value &=
                    (~(UNS_32)OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST(7));

                  /* increase the present range by one */
                  (PSU_DCDC_RANGE_T)volt_value++;

                  /*set the intermidiate range */
                  reg_value |= (volt_value <<
                                OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST_POS);

                  /* write the ad_reg_otgdclic_rw register through i2c
                     interface */
                  if (psu_dcdc_i2c_write(i2cdev1,
                                         (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                         &reg_value) == _ERROR)
                  {
                    return _ERROR;
                  }
                }
              }
              break;

            case PSU_DCDC_DCDC2:
              /* get the DCDC2 control bits to the lower byte */
              volt_value = (reg_value &
                            OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST(7)) >>
                           OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST_POS;

              /* if previous range greater than the specified range */
              if ((PSU_DCDC_RANGE_T)volt_value >
                  *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
              {
                /* do a step wise decrement of the present range and
                   set it, until it becomes equal to the specified
                   range */
                while ((PSU_DCDC_RANGE_T)volt_value >
                       *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
                {
                  /* reset the control bits for DCDC2 */
                  reg_value &=
                    (~(UNS_32)OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST(7));

                  /* reduce the present range by one */
                  (PSU_DCDC_RANGE_T)volt_value--;

                  /*set the intermidiate range */
                  reg_value |= (volt_value <<
                                OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST_POS);

                  /* write the ad_reg_otgdclic_rw register through i2c
                     interface */
                  if (psu_dcdc_i2c_write(i2cdev1,
                                         (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                         &reg_value) == _ERROR)
                  {
                    return _ERROR;
                  }
                }
              }
              else
              {
                /* do a step wise increment of the present range and
                   set it, until it becomes equal to the specified
                   range */
                while ((PSU_DCDC_RANGE_T)volt_value <
                       *(((PSU_DCDC_VOLTAGE_T *)arg)->psu_dcdc_range))
                {
                  /* reset the control bits for DCDC2 */
                  reg_value &=
                    (~(UNS_32)OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST(7));

                  /* increase the present range by one */
                  (PSU_DCDC_RANGE_T)volt_value++;

                  /*set the intermidiate range */
                  reg_value |= (volt_value <<
                                OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST_POS);

                  /* write the ad_reg_otgdclic_rw register through i2c
                     interface */
                  if (psu_dcdc_i2c_write(i2cdev1,
                                         (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                         &reg_value) == _ERROR)
                  {
                    return _ERROR;
                  }
                }
              }
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

        case PSU_READ_VOLTAGE:
          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }
          /*check whether DCDC1 or DCDC2 is selected */
          switch (((PSU_DCDC_VOLTAGE_T *) arg)->psu_dcdc_select)
          {
            case PSU_DCDC_DCDC1:
              /* get the DCDC1 control bits to the lower byte */
              volt_value = (reg_value &
                            OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST(7)) >>
                           OTGDCLIC_RW_DCDC_CTRL_DCDC1_ADJUST_POS;

              *(((PSU_DCDC_VOLTAGE_T *) arg)->psu_dcdc_range)
              = (PSU_DCDC_RANGE_T)volt_value;
              break;

            case PSU_DCDC_DCDC2:
              /* get the DCDC2 control bits to the lower byte */
              volt_value = (reg_value &
                            OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST(7)) >>
                           OTGDCLIC_RW_DCDC_CTRL_DCDC2_ADJUST_POS;

              *(((PSU_DCDC_VOLTAGE_T *) arg)->psu_dcdc_range)
              = (PSU_DCDC_RANGE_T)volt_value;
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

