siredmar/master/Recherche/EA313x/software/csps/lpc313x/source/lpc315x_psu_driver.c
        case PSU_SET_STABLE_CLOCK:
          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }

          switch (arg)
          {
            case PSU_DCDC_CLK_OFF:
              reg_value &= ~((UNS_32)OTGDCLIC_RW_DCDC_CTRL_CLK_STABLE);
              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            case PSU_DCDC_CLK_ON:
              reg_value |= ((UNS_32)OTGDCLIC_RW_DCDC_CTRL_CLK_STABLE);
              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

        case PSU_ENABLE_LDO:
          /* read the ad_reg_mod_id register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_mod_id),
                                &minor_rev) == _ERROR)
          {
            return _ERROR;
          }
          minor_rev = (minor_rev & MOD_ID_MINOR_REVISION(15)) >>
                      MOD_ID_MINOR_REVISION_POS;

          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }

          switch (arg)
          {
            case PSU_DCDC_LDO_OFF:
              if (minor_rev >= S_DCDC_AD_MINOR_VERSION_3)
              {
                reg_value |= ((UNS_32)OTGDCLIC_RW_DCDC_CTRL_LDO_ON);
              }
              else
              {
                reg_value &= ~((UNS_32)OTGDCLIC_RW_DCDC_CTRL_LDO_ON);
              }

              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            case PSU_DCDC_LDO_ON:
              if (minor_rev >= S_DCDC_AD_MINOR_VERSION_3)
              {
                reg_value &= ~((UNS_32)OTGDCLIC_RW_DCDC_CTRL_LDO_ON);
              }
              else
              {
                reg_value |= ((UNS_32)OTGDCLIC_RW_DCDC_CTRL_LDO_ON);
              }
              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

        case PSU_GET_STATUS:
          /* read the ad_reg_dcdclic_ro register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_dcdclic_ro),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }

          switch (arg)
          {
            case PSU_DCDC_USB_DETECT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_USB_DETECT)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC2_MODE_CONT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVCONT_1V8)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC1_MODE_CONT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVCONT_3V3)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC2_MODE_DISCONT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVDISC_1V8)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC1_MODE_DISCONT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVDISC_3V3)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC2_MODE_INIT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVINIT_1V8)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC1_MODE_INIT:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVINIT_3V3)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case PSU_DCDC_DCDC2_MODE_RAMPUP:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVRAMP_1V8)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

