siredmar/master/Recherche/EA313x/software/csps/lpc313x/source/lpc315x_psu_driver.c
            case PSU_DCDC_DCDC1_MODE_RAMPUP:
              if (reg_value & DCDCLIC_RO_DCDC_CTRL_INVRAMP_3V3)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            default:
              /* Unsupported parameter */
              status = LPC_BAD_PARAMS;
          }
          break;

        case PSU_SET_1V8_CONTROL:
          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }

          switch (arg)
          {
            case PSU_DCDC_LDO3_1V4:
              reg_value &= ~((UNS_32)OTGDCLIC_RW_DCDC_CTRL_SEL1V8);
              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            case PSU_DCDC_LDO3_1V8:
              reg_value |= ((UNS_32)OTGDCLIC_RW_DCDC_CTRL_SEL1V8);
              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

        case PSU_SET_USBOTG_CHARGE_PUMP_CTRL:
          switch (arg)
          {
            case PSU_DCDC_USBOTGCHARGEPUMPCTRL_OFF:
              /* read the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_read(i2cdev1,
                                    (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                    &reg_value) == _ERROR)
              {
                return _ERROR;
              }

              reg_value &= ~((UNS_32)OTGDCLIC_RW_USBOTG_CTRL_PON);

              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              /* read the ad_reg_cgu_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_read(i2cdev1,
                                    (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                                    &reg_value) == _ERROR)
              {
                return _ERROR;
              }

              /* Power down USBOTG clock */
              reg_value |= ((UNS_32)CGU_RW_PD_USBOTG_CLK);

              /* write the ad_reg_cgu_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            case PSU_DCDC_USBOTGCHARGEPUMPCTRL_ON:
              /* read the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_read(i2cdev1,
                                    (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                    &reg_value) == _ERROR)
              {
                return _ERROR;
              }

              reg_value |= ((UNS_32)OTGDCLIC_RW_USBOTG_CTRL_PON);

              /* write the ad_reg_otgdclic_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }

              /* read the ad_reg_cgu_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_read(i2cdev1,
                                    (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                                    &reg_value) == _ERROR)
              {
                return _ERROR;
              }

              /* Power up USBOTG clock */
              reg_value &= ~((UNS_32)CGU_RW_PD_USBOTG_CLK);

              /* write the ad_reg_cgu_rw register through i2c
                 interface */
              if (psu_dcdc_i2c_write(i2cdev1,
                                     (UNS_32)&(psudat.regptr->ad_reg_cgu_rw),
                                     &reg_value) == _ERROR)
              {
                return _ERROR;
              }
              break;

            default:
              status = _ERROR;
              break;
          }
          break;

        case PSU_GET_USBOTG_CHARGE_PUMP_CTRL:
          /* read the ad_reg_otgdclic_rw register through i2c
             interface */
          if (psu_dcdc_i2c_read(i2cdev1,
                                (UNS_32)&(psudat.regptr->ad_reg_otgdclic_rw),
                                &reg_value) == _ERROR)
          {
            return _ERROR;
          }

          reg_value = (reg_value &
                       OTGDCLIC_RW_USBOTG_CTRL_PON) >>
                      OTGDCLIC_RW_USBOTG_CTRL_PON_POS;

          *(PSU_DCDC_USBOTGCHARGEPUMPCTRL_T *)arg
          = (PSU_DCDC_USBOTGCHARGEPUMPCTRL_T)reg_value;
          break;

        default:
          /* Unsupported parameter */
          status = LPC_BAD_PARAMS;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: psu_read
 *
 * Purpose: PSU read function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:     Pointer to PSU descriptor
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 psu_read(INT_32 devid,
                void *buffer,
                INT_32 max_bytes)
{
  return 0;
}

/***********************************************************************
 *
 * Function: psu_write
 *
 * Purpose: PSU write function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:   Pointer to PSU descriptor
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 psu_write(INT_32 devid,
                 void *buffer,
                 INT_32 n_bytes)
{
  return 0;
}
